InformationRegisters/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказа</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПланыПоступлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПланыПоступлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПланПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПолучателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПланПоступления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ПланПоступления</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыЗаказа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспедиторИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспедиторТелефон</Name>
					<Comment>Допущение: мобильный или стационарный телефон в РФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспедиторАвто</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ОбработчикиРегламентныхЗаданий/Ext/Module.bsl
Функция ТекстЗапроса_ЦеликомЗакрытыеПланыПоступлений()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтатусыЗаказов.Заказ КАК Заказ
	|ПОМЕСТИТЬ ЗаказыКПоступлению
	|ИЗ
	|	РегистрСведений.СтатусыЗаказа.СрезПоследних(
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ТаблицаЗаказов.Заказ КАК Заказ
	|				ИЗ
	|					РегистрСведений.ПланыПоступлений КАК ПланыПоступлений
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланПоступления.Заказы КАК ТаблицаЗаказов
	|						ПО
	|							ТаблицаЗаказов.Ссылка = ПланыПоступлений.ПланПоступления)) КАК СтатусыЗаказов
	|ГДЕ
	|	СтатусыЗаказов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказа.ОжидаетсяПоступление)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыПоступлений.ПланПоступления КАК ПланПоступления
	|ИЗ
	|	РегистрСведений.ПланыПоступлений КАК ПланыПоступлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланПоступления.Заказы КАК ТаблицаЗаказов
	|		ПО (ТаблицаЗаказов.Ссылка = ПланыПоступлений.ПланПоступления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыКПоступлению КАК ЗаказыКПоступлению
	|		ПО (ЗаказыКПоступлению.Заказ = ТаблицаЗаказов.Заказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПоступлений.ПланПоступления
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ЗаказыКПоступлению.Заказ ЕСТЬ NULL) = ИСТИНА";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ОчиститьПланыПоступлений() Экспорт
	
	Запрос = Новый Запрос(ТекстЗапроса_ЦеликомЗакрытыеПланыПоступлений());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			РегистрыСведений.ПланыПоступлений.Заблокировать(Выборка.ПланПоступления);
			РегистрыСведений.ПланыПоступлений.Удалить(Выборка.ПланПоступления);
		Исключение
			ОтменитьТранзакцию();
			// TODO: Запись журнала регистрации
		КонецПопытки;		
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
КонецПроцедуры
